# Zone Perimeter Property

Source: https://www.revitapidocs.com/2026/c2cd4dc0-7b4d-65cf-39cb-68ce826ee1e3.htm

---

| Zone Perimeter Property |
| --- |

**Note: This API is now obsolete.**

Get the Perimeter of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
public double Perimeter { get; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>
Public ReadOnly Property Perimeter As Double
	Get
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
property double Perimeter {
	double get ();
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>]
member Perimeter : float with get
```

#### Property Value

Double Remarks This property is used to get the Perimeter of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace